
tap "caskroom/cask"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sjorek/php", "file:///Users/stephan.jorek/Documents/Brandung/Workspace/homebrew-php/.git"

# Dependency Manager for PHP
brew "composer"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Completion script for docker-compose
brew "docker-compose-completion"
# Completion script for docker-machine
brew "docker-machine-completion"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Proxy for serving git repositories over SSH
brew "git-ssh"
# Mac App Store command-line interface
brew "mas"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@7.2"
# General-purpose scripting language
brew "php@7.3"
# General-purpose scripting language
brew "php@7.4"
# Unified tool to manage your Rancher server
brew "rancher-cli"
# Docker Compose compatible client to deploy to Rancher
brew "rancher-compose"
# ddev: a local development environment management system
brew "drud/ddev/ddev"
# Dependency Manager for PHP
brew "sjorek/php/composer@1"
# Dependency Manager for PHP
brew "sjorek/php/composer@2"

cask "browserstacklocal"
cask "docker"

mas "Xcode", id: 497799835
